### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # helm_release.onp_cluster_argocd will be created
+   resource "helm_release" "onp_cluster_argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       recreate_pods              = true
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = true
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                # Config values for the ArgoCD Helm Chart.
                # For default values, see
                # https://github.com/argoproj/argo-helm/blob/3a2858aa98f607b495d34db0da2a7a3ecad3eaa0/charts/argo-cd/values.yaml
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                    maxReplicas: 5
                    # -- Average CPU utilization percentage (to the requested resource) for the Argo CD server [HPA]
                    targetCPUUtilizationPercentage: 90
                    # -- Average memory utilization percentage (to the requested resource) for the Argo CD server [HPA]
                    targetMemoryUtilizationPercentage: 175
                  resources:
                    requests:
                      cpu: 100m
                      memory: 128Mi
                    limits:
                      cpu: 200m
                      memory: 192Mi
                  pdb:
                    enabled: true
                    minAvailable: 1
                    maxUnavailable: 0
                  additionalProjects:
-                     name: argocd-root
                      namespace: argocd
                      description: The top-level project
                      sourceRepos:
-                         "*"
                      destinations:
-                         namespace: "*"
                          server: https://kubernetes.default.svc
                      clusterResourceWhitelist:
-                         group: "*"
                          kind: "*"
                
                  additionalApplications:
-                     name: argocd-root-app-of-apps
                      namespace: argocd
                      project: argocd-root
                      source:
                        repoURL: https://github.com/GiganticMinecraft/seichi_infra
                        targetRevision: main
                        path: seichi-onp-k8s/manifests/seichi-kubernetes/apps/root
                      destination:
                        server: https://kubernetes.default.svc
                        namespace: argocd
                      syncPolicy:
                        automated:
                          prune: true
                          selfHeal: true
                          allowEmpty: true
                        syncOptions:
-                           CreateNamespace=true
                        retry:
                          limit: -1
                          backoff:
                            duration: 5s
                            factor: 2
                            maxDuration: 2m
                
                  configEnabled: true
                  # -- [General Argo CD configuration]
                  config:
                    # Argo CD instance label key
                    application.instanceLabelKey: argocd.argoproj.io/instance
                    kustomize.buildOptions: --load-restrictor LoadRestrictionsNone
                    ## Following settings are required when configuring SSO
                    # Argo CD's externally facing base URL (optional).
                    url: https://argocd.onp-k8s.admin.seichi.click
                    dex.config: |
                      connectors:
-                         type: github
                          id: github
                          name: GitHub
                          config:
                            clientID: e7e08e1b813a638bdd99
                            clientSecret: $argocd-github-oauth-app-secret:ARGOCD_GITHUB_OAUTH_APP_SECRET
                            orgs:
-                             name: GiganticMinecraft
                    admin.enabled: "false"
                
                  rbacConfig:
                    # policy.csv is an file containing user-defined RBAC policies and role definitions (optional).
                    # Policy rules are in the form:
                    #   p, subject, resource, action, object, effect
                    # Role definitions and bindings are in the form:
                    #   g, subject, inherited-subject
                    # See https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/rbac.md for additional information.
                    policy.csv: |
                      g, GiganticMinecraft:admin-team, role:admin
                      g, GiganticMinecraft:infra-collaborator, role:admin
                    # policy.default is the name of the default role which Argo CD will falls back to, when
                    # authorizing API requests (optional). If omitted or empty, users may be still be able to login,
                    # but will see no apps, projects, etc...
                    policy.default: role:readonly
                
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                controller:
                  enableStatefulSet: true
                  resources:
                    limits:
                      cpu: 500m
                      memory: 1024Mi
                    requests:
                      cpu: 250m
                      memory: 768Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                dex:
                  resources:
                    limits:
                      cpu: 100m
                      memory: 192Mi
                    requests:
                      cpu: 50m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                redis:
                  resources:
                    limits:
                      cpu: 200m
                      memory: 256Mi
                    requests:
                      cpu: 100m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                repoServer:
                  replicaCount: 1
                  resources:
                    requests:
                      cpu: 500m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                applicationSet:
                  replicaCount: 1
                  resources:
                    requests:
                      cpu: 500m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                notifications:
                  resources:
                    limits:
                      cpu: 100m
                      memory: 64Mi
                    requests:
                      cpu: 100m
                      memory: 64Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
            EOT,
        ]
+       verify                     = false
+       version                    = "4.8.3"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_namespace.cloudflared_tunnel_exits will be created
+   resource "kubernetes_namespace" "cloudflared_tunnel_exits" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "cloudflared-tunnel-exits"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.minio will be created
+   resource "kubernetes_namespace" "minio" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "minio"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_argocd will be created
+   resource "kubernetes_namespace" "onp_argocd" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_monitoring will be created
+   resource "kubernetes_namespace" "onp_monitoring" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "monitoring"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_seichi_debug_gateway will be created
+   resource "kubernetes_namespace" "onp_seichi_debug_gateway" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "seichi-debug-gateway"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_seichi_gateway will be created
+   resource "kubernetes_namespace" "onp_seichi_gateway" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "seichi-gateway"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_sentry will be created
+   resource "kubernetes_namespace" "onp_sentry" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "sentry"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_synology_csi will be created
+   resource "kubernetes_namespace" "onp_synology_csi" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "synology-csi"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.cloudflared_tunnel_credential will be created
+   resource "kubernetes_secret" "cloudflared_tunnel_credential" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "cloudflared-tunnel-credential"
+           namespace        = "cloudflared-tunnel-exits"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.minio_root_user will be created
+   resource "kubernetes_secret" "minio_root_user" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "minio-root-user"
+           namespace        = "minio"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_argocd_github_oauth_app_secret will be created
+   resource "kubernetes_secret" "onp_argocd_github_oauth_app_secret" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-github-oauth-app-secret"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_grafana_github_oauth_app_secret will be created
+   resource "kubernetes_secret" "onp_grafana_github_oauth_app_secret" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "grafana-github-oauth-app-secret"
+           namespace        = "monitoring"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_logdna_agent_ingestion_key will be created
+   resource "kubernetes_secret" "onp_logdna_agent_ingestion_key" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "logdna-agent-key"
+           namespace        = "cluster-wide-apps"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_synology_csi will be created
+   resource "kubernetes_secret" "onp_synology_csi" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "client-info-secret"
+           namespace        = "synology-csi"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.onp_cluster_resources.helm_release.onp_cluster_argocd will be destroyed
  # (because helm_release.onp_cluster_argocd is not in configuration)
-   resource "helm_release" "onp_cluster_argocd" {
-       atomic                     = false -> null
-       chart                      = "argo-cd" -> null
-       cleanup_on_fail            = true -> null
-       create_namespace           = false -> null
-       dependency_update          = false -> null
-       disable_crd_hooks          = false -> null
-       disable_openapi_validation = false -> null
-       disable_webhooks           = false -> null
-       force_update               = false -> null
-       id                         = "argocd" -> null
-       lint                       = false -> null
-       max_history                = 0 -> null
-       metadata                   = [
-           {
-               app_version = "v2.3.4"
-               chart       = "argo-cd"
-               name        = "argocd"
-               namespace   = "argocd"
-               revision    = 12
-               values      = jsonencode(
                    {
-                       applicationSet = {
-                           metrics      = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           replicaCount = 1
-                           resources    = {
-                               requests = {
-                                   cpu    = "500m"
-                                   memory = "128Mi"
                                }
                            }
                        }
-                       controller     = {
-                           enableStatefulSet = true
-                           metrics           = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           resources         = {
-                               limits   = {
-                                   cpu    = "500m"
-                                   memory = "1024Mi"
                                }
-                               requests = {
-                                   cpu    = "250m"
-                                   memory = "768Mi"
                                }
                            }
                        }
-                       dex            = {
-                           metrics   = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           resources = {
-                               limits   = {
-                                   cpu    = "100m"
-                                   memory = "192Mi"
                                }
-                               requests = {
-                                   cpu    = "50m"
-                                   memory = "128Mi"
                                }
                            }
                        }
-                       notifications  = {
-                           metrics   = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           resources = {
-                               limits   = {
-                                   cpu    = "100m"
-                                   memory = "64Mi"
                                }
-                               requests = {
-                                   cpu    = "100m"
-                                   memory = "64Mi"
                                }
                            }
                        }
-                       redis          = {
-                           metrics   = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           resources = {
-                               limits   = {
-                                   cpu    = "200m"
-                                   memory = "256Mi"
                                }
-                               requests = {
-                                   cpu    = "100m"
-                                   memory = "128Mi"
                                }
                            }
                        }
-                       repoServer     = {
-                           metrics      = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           replicaCount = 1
-                           resources    = {
-                               requests = {
-                                   cpu    = "500m"
-                                   memory = "128Mi"
                                }
                            }
                        }
-                       server         = {
-                           additionalApplications = [
-                               {
-                                   destination = {
-                                       namespace = "argocd"
-                                       server    = "https://kubernetes.default.svc"
                                    }
-                                   name        = "argocd-root-app-of-apps"
-                                   namespace   = "argocd"
-                                   project     = "argocd-root"
-                                   source      = {
-                                       path           = "seichi-onp-k8s/manifests/seichi-kubernetes/apps/root"
-                                       repoURL        = "https://github.com/GiganticMinecraft/seichi_infra"
-                                       targetRevision = "main"
                                    }
-                                   syncPolicy  = {
-                                       automated   = {
-                                           allowEmpty = true
-                                           prune      = true
-                                           selfHeal   = true
                                        }
-                                       retry       = {
-                                           backoff = {
-                                               duration    = "5s"
-                                               factor      = 2
-                                               maxDuration = "2m"
                                            }
-                                           limit   = -1
                                        }
-                                       syncOptions = [
-                                           "CreateNamespace=true",
                                        ]
                                    }
                                },
                            ]
-                           additionalProjects     = [
-                               {
-                                   clusterResourceWhitelist = [
-                                       {
-                                           group = "*"
-                                           kind  = "*"
                                        },
                                    ]
-                                   description              = "The top-level project"
-                                   destinations             = [
-                                       {
-                                           namespace = "*"
-                                           server    = "https://kubernetes.default.svc"
                                        },
                                    ]
-                                   name                     = "argocd-root"
-                                   namespace                = "argocd"
-                                   sourceRepos              = [
-                                       "*",
                                    ]
                                },
                            ]
-                           autoscaling            = {
-                               enabled                           = true
-                               maxReplicas                       = 5
-                               minReplicas                       = 2
-                               targetCPUUtilizationPercentage    = 90
-                               targetMemoryUtilizationPercentage = 175
                            }
-                           config                 = {
-                               "admin.enabled"                = "false"
-                               "application.instanceLabelKey" = "argocd.argoproj.io/instance"
-                               "dex.config"                   = <<-EOT
                                    connectors:
-                                       type: github
                                        id: github
                                        name: GitHub
                                        config:
                                          clientID: e7e08e1b813a638bdd99
                                          clientSecret: $argocd-github-oauth-app-secret:ARGOCD_GITHUB_OAUTH_APP_SECRET
                                          orgs:
-                                           name: GiganticMinecraft
                                EOT
-                               "kustomize.buildOptions"       = "--load-restrictor LoadRestrictionsNone"
-                               url                            = "https://argocd.onp-k8s.admin.seichi.click"
                            }
-                           configEnabled          = true
-                           metrics                = {
-                               enabled        = true
-                               serviceMonitor = {
-                                   additionalLabels = {
-                                       release = "prometheus"
                                    }
-                                   enabled          = true
                                }
                            }
-                           pdb                    = {
-                               enabled        = true
-                               maxUnavailable = 0
-                               minAvailable   = 1
                            }
-                           rbacConfig             = {
-                               "policy.csv"     = <<-EOT
                                    g, GiganticMinecraft:admin-team, role:admin
                                    g, GiganticMinecraft:infra-collaborator, role:admin
                                EOT
-                               "policy.default" = "role:readonly"
                            }
-                           resources              = {
-                               limits   = {
-                                   cpu    = "200m"
-                                   memory = "192Mi"
                                }
-                               requests = {
-                                   cpu    = "100m"
-                                   memory = "128Mi"
                                }
                            }
                        }
                    }
                )
-               version     = "4.8.3"
            },
        ] -> null
-       name                       = "argocd" -> null
-       namespace                  = "argocd" -> null
-       recreate_pods              = true -> null
-       render_subchart_notes      = true -> null
-       replace                    = false -> null
-       repository                 = "https://argoproj.github.io/argo-helm" -> null
-       reset_values               = true -> null
-       reuse_values               = false -> null
-       skip_crds                  = false -> null
-       status                     = "deployed" -> null
-       timeout                    = 300 -> null
-       values                     = [
-           <<-EOT
                # Config values for the ArgoCD Helm Chart.
                # For default values, see
                # https://github.com/argoproj/argo-helm/blob/3a2858aa98f607b495d34db0da2a7a3ecad3eaa0/charts/argo-cd/values.yaml
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                    maxReplicas: 5
                    # -- Average CPU utilization percentage (to the requested resource) for the Argo CD server [HPA]
                    targetCPUUtilizationPercentage: 90
                    # -- Average memory utilization percentage (to the requested resource) for the Argo CD server [HPA]
                    targetMemoryUtilizationPercentage: 175
                  resources:
                    requests:
                      cpu: 100m
                      memory: 128Mi
                    limits:
                      cpu: 200m
                      memory: 192Mi
                  pdb:
                    enabled: true
                    minAvailable: 1
                    maxUnavailable: 0
                  additionalProjects:
-                     name: argocd-root
                      namespace: argocd
                      description: The top-level project
                      sourceRepos:
-                         "*"
                      destinations:
-                         namespace: "*"
                          server: https://kubernetes.default.svc
                      clusterResourceWhitelist:
-                         group: "*"
                          kind: "*"
                
                  additionalApplications:
-                     name: argocd-root-app-of-apps
                      namespace: argocd
                      project: argocd-root
                      source:
                        repoURL: https://github.com/GiganticMinecraft/seichi_infra
                        targetRevision: main
                        path: seichi-onp-k8s/manifests/seichi-kubernetes/apps/root
                      destination:
                        server: https://kubernetes.default.svc
                        namespace: argocd
                      syncPolicy:
                        automated:
                          prune: true
                          selfHeal: true
                          allowEmpty: true
                        syncOptions:
-                           CreateNamespace=true
                        retry:
                          limit: -1
                          backoff:
                            duration: 5s
                            factor: 2
                            maxDuration: 2m
                
                  configEnabled: true
                  # -- [General Argo CD configuration]
                  config:
                    # Argo CD instance label key
                    application.instanceLabelKey: argocd.argoproj.io/instance
                    kustomize.buildOptions: --load-restrictor LoadRestrictionsNone
                    ## Following settings are required when configuring SSO
                    # Argo CD's externally facing base URL (optional).
                    url: https://argocd.onp-k8s.admin.seichi.click
                    dex.config: |
                      connectors:
-                         type: github
                          id: github
                          name: GitHub
                          config:
                            clientID: e7e08e1b813a638bdd99
                            clientSecret: $argocd-github-oauth-app-secret:ARGOCD_GITHUB_OAUTH_APP_SECRET
                            orgs:
-                             name: GiganticMinecraft
                    admin.enabled: "false"
                
                  rbacConfig:
                    # policy.csv is an file containing user-defined RBAC policies and role definitions (optional).
                    # Policy rules are in the form:
                    #   p, subject, resource, action, object, effect
                    # Role definitions and bindings are in the form:
                    #   g, subject, inherited-subject
                    # See https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/rbac.md for additional information.
                    policy.csv: |
                      g, GiganticMinecraft:admin-team, role:admin
                      g, GiganticMinecraft:infra-collaborator, role:admin
                    # policy.default is the name of the default role which Argo CD will falls back to, when
                    # authorizing API requests (optional). If omitted or empty, users may be still be able to login,
                    # but will see no apps, projects, etc...
                    policy.default: role:readonly
                
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                controller:
                  enableStatefulSet: true
                  resources:
                    limits:
                      cpu: 500m
                      memory: 1024Mi
                    requests:
                      cpu: 250m
                      memory: 768Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                dex:
                  resources:
                    limits:
                      cpu: 100m
                      memory: 192Mi
                    requests:
                      cpu: 50m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                redis:
                  resources:
                    limits:
                      cpu: 200m
                      memory: 256Mi
                    requests:
                      cpu: 100m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                repoServer:
                  replicaCount: 1
                  resources:
                    requests:
                      cpu: 500m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                applicationSet:
                  replicaCount: 1
                  resources:
                    requests:
                      cpu: 500m
                      memory: 128Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
                
                notifications:
                  resources:
                    limits:
                      cpu: 100m
                      memory: 64Mi
                    requests:
                      cpu: 100m
                      memory: 64Mi
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      additionalLabels:
                        release: prometheus
            EOT,
        ] -> null
-       verify                     = false -> null
-       version                    = "4.8.3" -> null
-       wait                       = true -> null
-       wait_for_jobs              = false -> null
    }

  # module.onp_cluster_resources.kubernetes_namespace.cloudflared_tunnel_exits will be destroyed
  # (because kubernetes_namespace.cloudflared_tunnel_exits is not in configuration)
-   resource "kubernetes_namespace" "cloudflared_tunnel_exits" {
-       id = "cloudflared-tunnel-exits" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "cloudflared-tunnel-exits" -> null
-           resource_version = "1606934" -> null
-           uid              = "b72a85dd-e4f5-415d-959c-772dc7c80d8d" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.minio will be destroyed
  # (because kubernetes_namespace.minio is not in configuration)
-   resource "kubernetes_namespace" "minio" {
-       id = "minio" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "minio" -> null
-           resource_version = "2652267" -> null
-           uid              = "a991c2eb-2473-4d19-be56-2b186b2cf072" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.onp_argocd will be destroyed
  # (because kubernetes_namespace.onp_argocd is not in configuration)
-   resource "kubernetes_namespace" "onp_argocd" {
-       id = "argocd" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "argocd" -> null
-           resource_version = "534252" -> null
-           uid              = "19d9f2e4-27c2-4611-9bf9-b59238d87fbb" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.onp_monitoring will be destroyed
  # (because kubernetes_namespace.onp_monitoring is not in configuration)
-   resource "kubernetes_namespace" "onp_monitoring" {
-       id = "monitoring" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "monitoring" -> null
-           resource_version = "534249" -> null
-           uid              = "4ae0bedf-78b0-46e7-944e-87d4e66208c4" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.onp_seichi_debug_gateway will be destroyed
  # (because kubernetes_namespace.onp_seichi_debug_gateway is not in configuration)
-   resource "kubernetes_namespace" "onp_seichi_debug_gateway" {
-       id = "seichi-debug-gateway" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "seichi-debug-gateway" -> null
-           resource_version = "534253" -> null
-           uid              = "9bb2caf7-4bda-41ef-aee3-013016a73489" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.onp_seichi_gateway will be destroyed
  # (because kubernetes_namespace.onp_seichi_gateway is not in configuration)
-   resource "kubernetes_namespace" "onp_seichi_gateway" {
-       id = "seichi-gateway" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "seichi-gateway" -> null
-           resource_version = "539442" -> null
-           uid              = "0334d892-74db-4cb2-8a2d-b5a1d0f39bfb" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.onp_sentry will be destroyed
  # (because kubernetes_namespace.onp_sentry is not in configuration)
-   resource "kubernetes_namespace" "onp_sentry" {
-       id = "sentry" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "sentry" -> null
-           resource_version = "1791118" -> null
-           uid              = "973fa260-0dc9-4832-9bf2-410a292b04f8" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_namespace.onp_synology_csi will be destroyed
  # (because kubernetes_namespace.onp_synology_csi is not in configuration)
-   resource "kubernetes_namespace" "onp_synology_csi" {
-       id = "synology-csi" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "synology-csi" -> null
-           resource_version = "1003509" -> null
-           uid              = "874c2cdd-3702-437d-aa5d-db3863622f91" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.cloudflared_tunnel_credential will be destroyed
  # (because kubernetes_secret.cloudflared_tunnel_credential is not in configuration)
-   resource "kubernetes_secret" "cloudflared_tunnel_credential" {
-       data      = (sensitive value)
-       id        = "cloudflared-tunnel-exits/cloudflared-tunnel-credential" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "cloudflared-tunnel-credential" -> null
-           namespace        = "cloudflared-tunnel-exits" -> null
-           resource_version = "1606937" -> null
-           uid              = "022cb7fc-e1e3-445a-9440-cd5e6170933f" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.minio_root_user will be destroyed
  # (because kubernetes_secret.minio_root_user is not in configuration)
-   resource "kubernetes_secret" "minio_root_user" {
-       data      = (sensitive value)
-       id        = "minio/minio-root-user" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "minio-root-user" -> null
-           namespace        = "minio" -> null
-           resource_version = "2652270" -> null
-           uid              = "6908723c-eeb1-4d5e-804f-b84a14091ff3" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.onp_argocd_github_oauth_app_secret will be destroyed
  # (because kubernetes_secret.onp_argocd_github_oauth_app_secret is not in configuration)
-   resource "kubernetes_secret" "onp_argocd_github_oauth_app_secret" {
-       data      = (sensitive value)
-       id        = "argocd/argocd-github-oauth-app-secret" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {
-               "app.kubernetes.io/part-of" = "argocd"
            } -> null
-           name             = "argocd-github-oauth-app-secret" -> null
-           namespace        = "argocd" -> null
-           resource_version = "760151" -> null
-           uid              = "7f42acdc-8e8c-413e-91c3-402e2fdfa7c0" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.onp_grafana_github_oauth_app_secret will be destroyed
  # (because kubernetes_secret.onp_grafana_github_oauth_app_secret is not in configuration)
-   resource "kubernetes_secret" "onp_grafana_github_oauth_app_secret" {
-       data      = (sensitive value)
-       id        = "monitoring/grafana-github-oauth-app-secret" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "grafana-github-oauth-app-secret" -> null
-           namespace        = "monitoring" -> null
-           resource_version = "760153" -> null
-           uid              = "acff3680-5ba2-49ba-81c5-a6d6cb58cda6" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.onp_logdna_agent_ingestion_key will be destroyed
  # (because kubernetes_secret.onp_logdna_agent_ingestion_key is not in configuration)
-   resource "kubernetes_secret" "onp_logdna_agent_ingestion_key" {
-       data      = (sensitive value)
-       id        = "cluster-wide-apps/logdna-agent-key" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "logdna-agent-key" -> null
-           namespace        = "cluster-wide-apps" -> null
-           resource_version = "552380" -> null
-           uid              = "2c184bde-b35c-4f1e-b2ed-0ab026f5e37c" -> null
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.onp_synology_csi will be destroyed
  # (because kubernetes_secret.onp_synology_csi is not in configuration)
-   resource "kubernetes_secret" "onp_synology_csi" {
-       data      = (sensitive value)
-       id        = "synology-csi/client-info-secret" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "client-info-secret" -> null
-           namespace        = "synology-csi" -> null
-           resource_version = "1003512" -> null
-           uid              = "b55624f7-8814-4351-8a74-92046aaf115d" -> null
        }
    }

Plan: 15 to add, 0 to change, 15 to destroy.
```
</details>